
# tap repositories and their packages

tap 'homebrew/core'
brew 'ansible'
brew 'asciiquarium'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bats'
brew 'bfg'
brew 'boxes'
brew 'brew-cask-completion'
brew 'cmake'
brew 'composer'
brew 'coreutils'
brew 'cowsay'
brew 'ctop'
brew 'curl'
brew 'dateutils'
brew 'deis'
brew 'diff-so-fancy'
brew 'diffutils'
brew 'dnsmasq'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'dockward'
brew 'dos2unix'
brew 'duti'
brew 'exa'
brew 'fasd'
brew 'ffmpeg'
brew 'figlet'
brew 'findutils', args: ['with-default-names']
brew 'fortune'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'ghq'
brew 'git'
brew 'git-extras'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-units', args: ['with-default-names']
brew 'go'
brew 'gpatch'
brew 'gradle'
brew 'grc'
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'hashcat'
brew 'hr'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'iftop'
brew 'imagemagick'
brew 'jid'
brew 'jq'
brew 'kops'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libtool'
brew 'livestreamer'
brew 'lnav'
brew 'mariadb'
brew 'mas'
brew 'miller'
brew 'moreutils'
brew 'mr'
brew 'mtr'
brew 'mycli'
brew 'neovim'
brew 'netcat'
brew 'nginx'
brew 'ngrep'
brew 'nmap'
brew 'node@6'
brew 'node@8', args: ['without-npm']
brew 'noti'
brew 'openconnect'
brew 'openssh'
brew 'p7zip'
brew 'pigz'
brew 'pv'
brew 'python'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'remarshal'
brew 'renameutils'
brew 'ripgrep'
brew 'rsync'
brew 'ruby'
brew 'rust'
brew 'shellcheck'
brew 'slackcat'
brew 'slurm'
brew 'socat'
brew 'spark'
brew 'ssh-copy-id'
brew 'stormssh'
brew 'stow'
brew 'switchaudio-osx'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'v8'
brew 'vimpager'
brew 'w3m'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'xmlstarlet'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-roboto'

tap 'homebrew/cask-versions'
cask '1password-beta'
cask 'docker-edge'
cask 'firefox-beta'
cask 'google-chrome-canary'
cask 'iterm2-nightly'

tap 'homebrew/command-not-found'

tap 'homebrew/services'

tap 'homebrew/cask'
cask '1password'
cask 'aerial'
cask 'android-studio'
cask 'authy'
cask 'charles'
cask 'console'
cask 'default-folder-x'
cask 'eclipse-ide'
cask 'electrum'
cask 'forklift'
cask 'gitkraken'
cask 'gitup'
cask 'imageoptim'
cask 'jetbrains-toolbox'
cask 'kitematic'
cask 'launchrocket'
cask 'lincastor'
cask 'onyx'
cask 'paw'
cask 'provisionql'
cask 'qlimagesize'
cask 'qlprettypatch'
cask 'qlvideo'
cask 'quicklook-json'
cask 'rcdefaultapp'
cask 'setapp'
cask 'sourcetree'
cask 'steam'
cask 'sublime-text'
cask 'tad'
cask 'torbrowser'
cask 'vagrant'
cask 'virtualbox'
cask 'webpquicklook'
cask 'xquartz'

tap 'datawire/blackbird'
brew 'telepresence'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Cask applications
cask 'adobe-air'
cask 'alfred'
cask 'archiver'
cask 'captain'
cask 'colorpicker-skalacolor'
cask 'dash'
cask 'dropbox'
cask 'electron-api-demos'
cask 'etcher'
cask 'firefox-developer-edition'
cask 'font-firamono-nerd-font-mono'
cask 'font-hack-nerd-font-mono'
cask 'font-source-code-pro'
cask 'gear-player'
cask 'gitscout'
cask 'google-chrome'
cask 'hopper-disassembler'
cask 'hosts'
cask 'java8'
cask 'kaleidoscope'
cask 'knockknock'
cask 'licecap'
cask 'mono-mdk'
cask 'mysimbl'
cask 'osxfuse'
cask 'prefs-editor'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklookapk'
cask 'robo-3t'
cask 'slack'
cask 'sqlpro-studio'
cask 'studio-3t'
cask 'suspicious-package'
cask 'textual'
cask 'tuntap'
cask 'vimr'
cask 'visual-studio-code'
cask 'wireshark'

# App Store applications
mas 'Jayson (1.8.1)', id: 1189824719
mas 'Keynote (8.1)', id: 409183694
mas 'Numbers (5.1)', id: 409203825
mas 'Pages (7.1)', id: 409201541
mas 'Quiver (3.1.3)', id: 866773894
mas 'Sip (4.5.2)', id: 507257563
mas 'Tweetbot (2.5.7)', id: 557168941
mas 'Twitterrific (5.3.3)', id: 1289378661
mas 'Xcode (9.4.1)', id: 497799835
