tap "datawire/blackbird"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
cask "java8"
cask "osxfuse"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Draw boxes around text
brew "boxes"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Top-like interface for container metrics
brew "ctop"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# The CLI for Deis Workflow
brew "deis"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion", link: false
# Port forwarding tool for Docker containers
brew "dockward"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Modern replacement for 'ls'
brew "exa"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# Infamous electronic fortune-cookie generator
brew "fortune"
# Generic library support script
brew "libtool"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU implementation of the famous stream editor
brew "gnu-sed", args: ["with-default-names"]
# GNU unit conversion tool
brew "gnu-units"
# Apply a diff file to an original
brew "gpatch"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Colorize logfiles and command output
brew "grc", args: ["HEAD"]
# GNU grep, egrep and fgrep
brew "grep", args: ["with-default-names"]
# Popular GNU data compression program
brew "gzip"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Command-line hex viewer
brew "hexyl"
# <hr />, for your terminal window
brew "hr"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Json incremental digger
brew "jid"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Production Grade K8s Installation, Upgrades, and Management
brew "kops"
# Pipes video from streaming services into a player such as VLC
brew "livestreamer"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Multiple Repository management tool
brew "mr"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Platform built on V8 to build network applications
brew "node@6"
# Trigger notifications when a process completes
brew "noti"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Parallel gzip
brew "pigz"
# Monitor data's progress through a pipe
brew "pv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Convert between TOML, YAML and JSON
brew "remarshal"
# Tools for file renaming
brew "renameutils"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: true
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Command-line utility for posting snippets to Slack
brew "slackcat"
# Yet another network load monitor
brew "slurm"
# netcat on steroids
brew "socat"
# Sparklines for the shell
brew "spark"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Command-line tool to manage your ssh connections
brew "stormssh"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Modern reverse proxy
brew "traefik"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's JavaScript engine
brew "v8"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# XML command-line utilities
brew "xmlstarlet"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Local dev environment attached to a remote Kubernetes cluster
brew "datawire/blackbird/telepresence"
cask "1password"
cask "adobe-air"
cask "aerial"
cask "alfred"
cask "android-platform-tools"
cask "archiver"
cask "asset-catalog-tinkerer"
cask "authy"
cask "azure-data-studio"
cask "barrier"
cask "captain"
cask "charles"
cask "colorpicker-skalacolor"
cask "dash"
cask "default-folder-x"
cask "discord"
cask "docker-edge"
cask "dropbox"
cask "eclipse-ide"
cask "electron-api-demos"
cask "electrum"
cask "etcher"
cask "firefox-beta"
cask "font-fira-code"
cask "font-firamono-nerd-font-mono"
cask "font-hack"
cask "font-hack-nerd-font-mono"
cask "font-roboto"
cask "font-source-code-pro"
cask "fork"
cask "forklift"
cask "gear-player"
cask "gitkraken"
cask "gitup"
cask "google-chrome"
cask "google-chrome-canary"
cask "hopper-disassembler"
cask "hosts"
cask "imageoptim"
cask "iterm2-beta"
cask "jetbrains-toolbox"
cask "kaleidoscope"
cask "kitematic"
cask "knockknock"
cask "launchcontrol"
cask "launchrocket"
cask "licecap"
cask "lincastor"
cask "mono-mdk"
cask "onyx"
cask "paw"
cask "prefs-editor"
cask "pritunl"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookapk"
cask "robo-3t"
cask "setapp"
cask "slack"
cask "soduto"
cask "steam"
cask "sublime-text"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "tad"
cask "taskexplorer"
cask "textual"
cask "tor-browser"
cask "tuntap"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "webpquicklook"
cask "whatsyoursign"
cask "wireshark"
cask "xquartz"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Quiver", id: 866773894
mas "Sip", id: 507257563
mas "Tweetbot", id: 557168941
mas "Twitterrific", id: 1289378661
mas "Xcode", id: 497799835
