tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'
cask 'java'
cask 'xquartz'
brew 'openssl'
brew 'pkg-config'
brew 'icu4c'
brew 'readline'
brew 'sqlite'
brew 'aircrack-ng'
brew 'android-platform-tools'
brew 'libyaml'
brew 'ansible'
brew 'apktool'
brew 'docbook'
brew 'asciidoc'
brew 'asciiquarium'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash-completion'
brew 'libatomic_ops'
brew 'bdw-gc'
brew 'bfg'
brew 'binutils'
brew 'boost'
brew 'boxes'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'git'
brew 'carthage'
brew 'go'
brew 'ccat'
brew 'cloc'
brew 'sphinx-doc'
brew 'cmake'
brew 'cmatrix'
brew 'cocoapods'
brew 'gmp'
brew 'coreutils'
brew 'cowsay'
brew 'cscope'
brew 'libssh2'
brew 'curl', args: ['with-libssh2']
brew 'dark-mode'
brew 'dateutils'
brew 'desk'
brew 'dex2jar'
brew 'node'
brew 'diff-so-fancy'
brew 'dockviz'
brew 'dos2unix'
brew 'doxygen'
brew 'fasd'
brew 'lame'
brew 'jpeg'
brew 'xz'
brew 'libtiff'
brew 'webp'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'figlet'
brew 'findutils', args: ['with-default-names']
brew 'fortune'
brew 'fswatch'
brew 'fzf'
brew 'mpfr'
brew 'gawk'
brew 'isl'
brew 'libmpc'
brew 'gcc'
brew 'gdbm'
brew 'ghq'
brew 'git-extras'
brew 'git-fixup'
brew 'git-ftp'
brew 'glew'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gobject-introspection'
brew 'sdl2'
brew 'sdl2_image'
brew 'gource'
brew 'gradle'
brew 'grc', args: ['HEAD']
brew 'gti'
brew 'ruby'
brew 'heroku'
brew 'lua'
brew 'highlight'
brew 'hr'
brew 'libtool'
brew 'htop-osx'
brew 'python3'
brew 'httpie'
brew 'httpstat'
brew 'hub'
brew 'icdiff'
brew 'iftop'
brew 'imagemagick', args: ['with-webp']
brew 'iozone'
brew 'ipcalc'
brew 'oniguruma'
brew 'jq'
brew 'keybase'
brew 'libgpg-error'
brew 'libassuan'
brew 'pinentry'
brew 'lastpass-cli', args: ['with-doc', 'with-pinentry']
brew 'libevent'
brew 'libewf'
brew 'python'
brew 'libmagic'
brew 'libsass'
brew 'libtasn1'
brew 'libxml2'
brew 'livestreamer'
brew 'lua51'
brew 'mackup'
brew 'macvim', args: ['with-override-system-vim']
brew 'mariadb', restart_service: true
brew 'mas'
brew 'masscan'
brew 'miller'
brew 'mongodb'
brew 'moreutils'
brew 'mtr'
brew 'multitail'
brew 'mycli'
brew 'netcat'
brew 'ngrep'
brew 'nmap'
brew 'no-more-secrets'
brew 'p7zip'
brew 'phantomjs'
brew 'pidcat'
brew 'pngcheck'
brew 'postgresql'
brew 'protobuf'
brew 'pup'
brew 'pv'
brew 'pwntools'
brew 'swig'
brew 'vala'
brew 'valabind'
brew 'yara'
brew 'radare2'
brew 'rancher-compose'
brew 'ranger'
brew 'reattach-to-user-namespace', args: ['with-wrap-launchctl']
brew 'redis'
brew 'renameutils'
brew 'sassc'
brew 'screenfetch'
brew 'sl'
brew 'slackcat'
brew 'slurm'
brew 'socat'
brew 'spark'
brew 'ssh-copy-id'
brew 'stormssh'
brew 'stow'
brew 'surfraw'
brew 'syncthing'
brew 'syncthing-inotify'
brew 'textql'
brew 'the_silver_searcher'
brew 'tig'
brew 'utf8proc'
brew 'tmux'
brew 'tree'
brew 'unfs3'
brew 'unixodbc'
brew 'v8'
brew 'w3m'
brew 'watch'
brew 'watchman'
brew 'webkit2png'
brew 'wget'
brew 'wrk'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/completions/docker-completion'
brew 'homebrew/completions/docker-compose-completion'
brew 'homebrew/completions/docker-machine-completion'
brew 'homebrew/dupes/diffutils'
brew 'homebrew/dupes/gpatch'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/gzip'
brew 'homebrew/dupes/less'
brew 'homebrew/dupes/openssh'
brew 'homebrew/dupes/rsync'
brew 'homebrew/php/php71'
brew 'homebrew/php/composer'
brew 'homebrew/php/drupalconsole'
brew 'homebrew/php/drush'
brew 'homebrew/php/php71-redis'
brew 'homebrew/php/php71-xdebug'
brew 'homebrew/php/psysh'
brew 'homebrew/php/wp-cli'
cask '1password'
cask 'aerial'
cask 'airflow'
cask 'alcatraz'
cask 'alfred'
cask 'android-studio'
cask 'appcleaner'
cask 'atom'
cask 'beamer'
cask 'bettertouchtool'
cask 'betterzipql'
cask 'bitbar'
cask 'charles'
cask 'dash'
cask 'diffmerge'
cask 'discord'
cask 'dropbox'
cask 'electrum'
cask 'exa'
cask 'fiddler'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'gear-player'
cask 'gitup'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'hopper-disassembler'
cask 'hosts'
cask 'imageoptim'
cask 'interarchy'
cask 'iterm2-beta'
cask 'jadengeller-helium'
cask 'jetbrains-toolbox'
cask 'karabiner'
cask 'kitematic'
cask 'mono-mdk'
cask 'osxfuse'
cask 'paw'
cask 'provisionql'
cask 'psequel'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'rcdefaultapp'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sqlpro-studio'
cask 'sshfs'
cask 'steam'
cask 'stremio'
cask 'suspicious-package'
cask 'taskpaper'
cask 'textual'
cask 'torbrowser'
cask 'totalfinder'
cask 'tower'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'webpquicklook'
cask 'wireshark'
mas 'Quiver (3.0.3)', id: 866773894
mas 'Tweetbot (2.4.4)', id: 557168941
mas 'Pages (6.0)', id: 409201541
mas 'Xcode (8.0)', id: 497799835
mas 'Numbers (4.0)', id: 409203825
