
# tap repositories and their packages

tap 'caskroom/cask'
cask '1password'
cask 'adobe-air'
cask 'aerial'
cask 'alfred'
cask 'android-studio'
cask 'archiver'
cask 'authy-desktop'
cask 'bettertouchtool'
cask 'betterzipql'
cask 'blockblock'
cask 'captain'
cask 'cdock'
cask 'charles'
cask 'colorpicker-skalacolor'
cask 'console'
cask 'dash'
cask 'default-folder-x'
cask 'docker'
cask 'dropbox'
cask 'dropzone'
cask 'easysimbl'
cask 'electron-api-demos'
cask 'electrum'
cask 'etcher'
cask 'forklift'
cask 'gear-player'
cask 'gitkraken'
cask 'gitscout'
cask 'gitup'
cask 'google-chrome'
cask 'hopper-disassembler'
cask 'hosts'
cask 'iina'
cask 'imageoptim'
cask 'interarchy'
cask 'java'
cask 'jetbrains-toolbox'
cask 'karabiner'
cask 'kitematic'
cask 'knockknock'
cask 'launchrocket'
cask 'licecap'
cask 'lincastor'
cask 'lunchy'
cask 'macfusion'
cask 'meld'
cask 'mono-mdk'
cask 'mysimbl'
cask 'nzbget'
cask 'onyx'
cask 'osxfuse'
cask 'paw'
cask 'prefs-editor'
cask 'provisionql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookapk'
cask 'rcdefaultapp'
cask 'sequel-pro'
cask 'slack'
cask 'sqlpro-studio'
cask 'steam'
cask 'suspicious-package'
cask 'synergy'
cask 'textual'
cask 'torbrowser'
cask 'vagrant'
cask 'vimr'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'webpquicklook'
cask 'whatsyoursign'
cask 'wireshark'
cask 'xquartz'
cask 'xtrafinder'

tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-firamono-nerd-font-mono'
cask 'font-hack-nerd-font-mono'
cask 'font-hack'
cask 'font-roboto'
cask 'font-source-code-pro'

tap 'caskroom/versions'
cask 'google-chrome-canary'
cask 'iterm2-beta'

tap 'homebrew/bundle'

tap 'homebrew/command-not-found'

tap 'homebrew/core'
brew 'gnu-units', args: ['with-default-names']
brew 'ssh-copy-id'
brew 'gdb'
brew 'httpie'
brew 'findutils', args: ['with-default-names']
brew 'kops'
brew 'go'
brew 'cowsay'
brew 'jid'
brew 'bfg'
brew 'ripgrep'
brew 'htop-osx'
brew 'moreutils'
brew 'mariadb'
brew 'v8'
brew 'youtube-dl'
brew 'python'
brew 'watch'
brew 'nginx'
brew 'boxes'
brew 'python3'
brew 'ffmpeg'
brew 'zsh'
brew 'fortune'
brew 'iftop'
brew 'zsh-completions'
brew 'gradle'
brew 'unrar'
brew 'dnsmasq'
brew 'node@6'
brew 'stormssh'
brew 'miller'
brew 'slackcat'
brew 'docker-compose-completion'
brew 'ctop'
brew 'deis'
brew 'rsync'
brew 'vimpager'
brew 'asciiquarium'
brew 'redis'
brew 'reattach-to-user-namespace'
brew 'automake'
brew 'git-extras'
brew 'imagemagick', args: ['with-webp']
brew 'cmatrix'
brew 'jq'
brew 'gawk'
brew 'brew-cask-completion'
brew 'wget'
brew 'spark'
brew 'bash'
brew 'dockward'
brew 'openssh'
brew 'yarn'
brew 'stow'
brew 'awscli'
brew 'nmap'
brew 'slurm'
brew 'tmux'
brew 'duti'
brew 'fswatch'
brew 'bats'
brew 'pigz'
brew 'neovim'
brew 'openconnect'
brew 'git'
brew 'pv'
brew 'kubernetes-helm'
brew 'w3m'
brew 'tree'
brew 'heroku'
brew 'shellcheck'
brew 'fzf'
brew 'fasd'
brew 'hub'
brew 'hr'
brew 'ruby'
brew 'ngrep'
brew 'grep', args: ['with-default-names']
brew 'gpatch'
brew 'docker-completion'
brew 'mtr'
brew 'kubernetes-cli'
brew 'p7zip'
brew 'autoconf'
brew 'gnu-sed', args: ['with-default-names']
brew 'rust'
brew 'dateutils'
brew 'ansible'
brew 'socat'
brew 'mycli'
brew 'curl', args: ['with-libssh2']
brew 'lnav'
brew 'switchaudio-osx'
brew 'figlet'
brew 'gcc'
brew 'cmake'
brew 'lame'
brew 'xmlstarlet'
brew 'hashcat'
brew 'coreutils'
brew 'grc'
brew 'tig'
brew 'noti'
brew 'mas'
brew 'livestreamer'
brew 'mongodb'
brew 'renameutils'
brew 'libtool'
brew 'netcat'
brew 'dos2unix'
brew 'kompose'
brew 'ghq'
brew 'exa'
brew 'diffutils'
brew 'diff-so-fancy'
brew 'gzip'

tap 'homebrew/php'
brew 'php71-redis'
brew 'php71'
brew 'php71-xdebug'
brew 'composer'
brew 'php71-opcache'
brew 'php71-mcrypt'

tap 'homebrew/services'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
#appstore '1189824719 Jayson (1.8.1)'
#appstore '409183694 Keynote (7.2)'
#appstore '409203825 Numbers (4.2)'
#appstore '409201541 Pages (6.2)'
#appstore '866773894 Quiver (3.0.7)'
#appstore '507257563 Sip (4.5.2)'
#appstore '896450579 Textual (6.0.12)'
#appstore '585829637 Todoist (7.0.2)'
#appstore '557168941 Tweetbot (2.5.1)'
#appstore '497799835 Xcode (8.3.3)'
