
# tap repositories and their packages

tap 'caskroom/cask'
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'android-studio'
cask 'archiver'
cask 'bettertouchtool'
cask 'betterzipql'
cask 'captain'
cask 'cdock'
cask 'charles'
cask 'colorpicker-skalacolor'
cask 'dash'
cask 'default-folder-x'
cask 'dropbox'
cask 'easysimbl'
cask 'electrum'
cask 'forklift'
cask 'gear-player'
cask 'gitup'
cask 'google-chrome'
cask 'hopper-disassembler'
cask 'hosts'
cask 'iina'
cask 'imageoptim'
cask 'interarchy'
cask 'java'
cask 'jetbrains-toolbox'
cask 'karabiner'
cask 'kitematic'
cask 'launchrocket'
cask 'licecap'
cask 'lunchy'
cask 'meld'
cask 'mono-mdk'
cask 'mysimbl'
cask 'nzbget'
cask 'onyx'
cask 'osxfuse'
cask 'paw'
cask 'prefs-editor'
cask 'provisionql'
cask 'psequel'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'rcdefaultapp'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'sqlpro-studio'
cask 'steam'
cask 'suspicious-package'
cask 'synergy'
cask 'textual'
cask 'torbrowser'
cask 'totalfinder'
cask 'vagrant'
cask 'vimr'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'webpquicklook'
cask 'wireshark'
cask 'xquartz'

tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-roboto'
cask 'font-source-code-pro'

tap 'caskroom/versions'
cask 'docker-edge'
cask 'firefoxdeveloperedition'
cask 'google-chrome-canary'
cask 'iterm2-beta'

tap 'homebrew/bundle'

tap 'homebrew/command-not-found'

tap 'homebrew/completions'

tap 'homebrew/core'
brew 'ansible'
brew 'asciiquarium'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash-completion'
brew 'bdw-gc'
brew 'bfg'
brew 'binutils'
brew 'boost'
brew 'borg'
brew 'boxes'
brew 'brew-cask-completion'
brew 'cairo'
brew 'cloc'
brew 'cmake'
brew 'cmatrix'
brew 'cocoapods'
brew 'coreutils'
brew 'cowsay'
brew 'cscope'
brew 'curl'
brew 'dateutils'
brew 'deis'
brew 'desk'
brew 'diff-so-fancy'
brew 'diffutils'
brew 'dnsmasq'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'docker-machine-completion'
brew 'dockviz'
brew 'dockward'
brew 'dos2unix'
brew 'doxygen'
brew 'fasd'
brew 'ffmpeg'
brew 'figlet'
brew 'file-formula'
brew 'findutils', args: ['with-default-names']
brew 'fontconfig'
brew 'fortune'
brew 'freetype'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gdb'
brew 'gdbm'
brew 'gettext'
brew 'ghq'
brew 'git'
brew 'git-extras'
brew 'git-fixup'
brew 'git-ftp'
brew 'glew'
brew 'glib'
brew 'gmp'
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'go'
brew 'gobject-introspection'
brew 'gource'
brew 'gpatch'
brew 'gradle'
brew 'grc'
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'hashcat'
brew 'heroku'
brew 'hr'
brew 'html-xml-utils'
brew 'htop-osx'
brew 'httpie'
brew 'httpstat'
brew 'hub'
brew 'icu4c'
brew 'iftop'
brew 'imagemagick', args: ['with-webp']
brew 'ipcalc'
brew 'isl'
brew 'jemalloc'
brew 'jid'
brew 'jpeg'
brew 'jq'
brew 'kompose'
brew 'kops'
brew 'kube-aws'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lame'
brew 'less'
brew 'lftp'
brew 'libevent'
brew 'libewf'
brew 'libffi'
brew 'libgpg-error'
brew 'libidn'
brew 'libmagic'
brew 'libmpc'
brew 'libpng'
brew 'libsass'
brew 'libssh2'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libyaml'
brew 'liquibase'
brew 'livestreamer'
brew 'lnav'
brew 'lua'
brew 'lua@5.1'
brew 'macvim', args: ['with-override-system-vim']
brew 'mailhog'
brew 'mariadb'
brew 'mas'
brew 'mcrypt'
brew 'mhash'
brew 'miller'
brew 'moreutils', args: ['without-parallel']
brew 'mpfr'
brew 'msgpack'
brew 'mtr'
brew 'multitail'
brew 'mycli'
brew 'netcat'
brew 'nginx'
brew 'ngrep'
brew 'nmap'
brew 'no-more-secrets'
brew 'node'
brew 'noti'
brew 'nvm'
brew 'oniguruma'
brew 'openssh'
brew 'openssl'
brew 'openssl@1.1'
brew 'p7zip'
brew 'parallel'
brew 'pcre'
brew 'pidcat'
brew 'pigz'
brew 'pixman'
brew 'pkg-config'
brew 'pngcheck'
brew 'postgresql'
brew 'pup'
brew 'pv'
brew 'python'
brew 'python3'
brew 'radare2'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'renameutils'
brew 'ripgrep'
brew 'rsync'
brew 'ruby'
brew 'rust'
brew 'sassc'
brew 'screenresolution'
brew 'sdl2'
brew 'sdl2_image'
brew 'slackcat'
brew 'slurm'
brew 'socat'
brew 'spark'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'sshfs'
brew 'stormssh'
brew 'stow'
brew 'swig'
brew 'switchaudio-osx'
brew 'textql'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unibilium'
brew 'unison'
brew 'unixodbc'
brew 'unrar'
brew 'v8'
brew 'vala'
brew 'valabind'
brew 'vimpager', args: ['HEAD']
brew 'w3m'
brew 'watch'
brew 'watchman'
brew 'webkit2png'
brew 'webp'
brew 'wget'
brew 'wrk'
brew 'x264'
brew 'xmlstarlet'
brew 'xvid'
brew 'xz'
brew 'yara'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

tap 'homebrew/dupes'

tap 'homebrew/fuse'

tap 'homebrew/php'
brew 'composer'
brew 'php71'
brew 'php71-mcrypt'
brew 'php71-opcache'
brew 'php71-redis'
brew 'php71-xdebug'

tap 'homebrew/services'

tap 'homebrew/versions'

tap 'neovim/neovim'
brew 'neovim'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Homebrew packages
brew 'android-platform-tools'

# App Store applications
#appstore '409183694 Keynote (7.1.1)'
#appstore '409203825 Numbers (4.1.1)'
#appstore '409201541 Pages (6.1.1)'
#appstore '866773894 Quiver (3.0.6)'
#appstore '507257563 Sip (4.5.2)'
#appstore '896450579 Textual (6.0.10)'
#appstore '585829637 Todoist (6.3.20)'
#appstore '557168941 Tweetbot (2.5.1)'
#appstore '497799835 Xcode (8.3.2)'
